{
  "overview": {
    "task": "행렬과 선형변환의 기초 지식을 활용할 수 있고 간단한 수학적 명제를 증명할 수 있다. 행렬과 선형변환을 활용하는 실세계 현상 모델링 및 순수 수학적 탐구와 관련된 제시된 논문 자료 중 하나를 선택한다. 선택한 논문의 핵심 이론과 응용 사례를 면밀히 읽고 이해한 후, 정의, 명제, 정리를 실제 계산, 시뮬레이션 또는 모델 구현으로 구체적으로 적용한다. 또한, 적용 결과를 바탕으로 심화 질문을 도출하고, 그에 대한 분석 및 해결을 보고서에 포함한다. 보고서에는 논문 선택 동기, 연구 계획, 이론 정리, 적용 과정 및 결과, 도출된 질문과 성찰이 포함되며, 최종적으로 발표와 토론을 통해 결과를 공유한다.",
    "standards": "[12고수|02-01] 행렬의 뜻을 알고 행렬의 덧셈, 뺄셈, 실수배, 곱셈을 할 수 있다.\n[12고수|02-05] 선형변환의 뜻을 알고, 선형변환과 행렬 사이의 관계를 이해한다.\n[12고수|02-09] 고윳값과 고유벡터를 이용하여  행렬을 대각화할 수 있다.",
    "ideas": "행렬과 선형변환의 수학적 명제 증명 및 활용, 논문 분석 및 공학적 도구(MATLAB, Python 등)를 활용한 적용, 심화 질문 도출 및 성찰적 탐구, 보고서 작성 및 발표를 통한 의사소통",
    "criteria": {
      "type": "3-point",
      "levels": {
        "A": "행렬과 선형변환의 기초 지식을 활용할 수 있고 수학적 의미를 이해하여 수학적 사실 및 명제를 증명할 수 있음. 또한 관련 지식이 사용된 논문의 핵심 이론과 응용을 깊이 이해하고, 행렬과 선형변환의 개념을 실제 사례에 완벽하게 적용할 수 있다. 또한, MATLAB 등의 도구를 활용하여 정교한 계산 및 시뮬레이션을 수행하며, 연구 주제에 대해 심도 있는 성찰을 통해 기존 정리의 한계와 향후 연구 방향을 혁신적으로 제시할 수 있다.",
        "B": "행렬과 선형변환의 기초 지식을 기억하고 수학적 의미를 이해하여서 관련된 수학적 명제를 설명할 수 있음. 또한 관련 지식이 사용된 논문의 핵심 이론을 기본적으로 이해하여, 행렬과 선형변환의 주요 개념을 실제 사례에 적용할 수 있다. 또한, 연구 주제에 대해 몇 가지 의미 있는 질문을 제시하며, 그 결과와 한계에 대해 기본적인 성찰을 할 수 있다.",
        "C": "행렬과 선형변환의 간단한 수학적 명제를 이해할 수 있으며, 논문에 제시된 기본 개념을 일부 이해하여, 행렬과 선형변환의 기초 원리를 간단한 예시로 적용해 볼 수 있다. 또한, 연구 주제에 대해 최소한의 질문이나 관찰을 제시하여, 앞으로의 탐구에서 발전할 수 있는 기초를 마련할 수 있다."
      }
    }
  },
  "rubric": [
    {
      "name": "의사소통 능력",
      "type": "5-point",
      "scores": {
        "A": 4,
        "B": 3,
        "C": 2,
        "D": 1,
        "E": 0
      },
      "descriptions": {
        "A": "LaTeX를 능숙하게 사용하여 모든 수식과 기호를 정확하게 표현하였으며, 주어진 보고서 양식을 완벽하게 준수함.",
        "B": "LaTeX 수식과 기호를 대체로 올바르게 사용하였으나, 일부 사소한 오류가 있으며 보고서 양식을 대부분 준수함.",
        "C": "LaTeX 사용이 미흡하여 수식이나 기호 표현에 오류가 다소 발견되며, 보고서 양식을 일부 준수함.",
        "D": "LaTeX를 거의 사용하지 못하거나 수식/기호 표현에 중대한 오류가 있으며, 보고서 양식을 거의 준수하지 못함.",
        "E": "보고서의 양식을 갖추지 못했거나 LaTeX를 전혀 사용하지 않음."
      }
    },
    {
      "name": "이해하기",
      "type": "5-point",
      "scores": {
        "A": 4,
        "B": 3,
        "C": 2,
        "D": 1,
        "E": 0
      },
      "descriptions": {
        "A": "논문의 핵심 정의와 정리를 매우 정확하게 파악하고, 이를 자신만의 언어로 명확하고 논리정연하게 풀어서 설명함.",
        "B": "논문의 핵심 정의와 정리를 정확하게 작성하였으나, 자신만의 언어로 풀어서 설명하는 부분이 다소 미흡하거나 원문의 표현을 그대로 인용하는 데 그침.",
        "C": "논문의 주요 정의와 정리 중 일부만 파악하였거나, 내용의 정확성이 다소 부족하며, 자신만의 언어로 설명하는 것이 미흡함.",
        "D": "논문의 정의와 정리를 부정확하게 기술하였거나, 단순히 원문을 그대로 복사하여 붙여넣는 수준에 그침.",
        "E": "논문의 정의와 정리를 전혀 파악하지 못함."
      }
    },
    {
      "name": "적용하기",
      "type": "5-point",
      "scores": {
        "A": 4,
        "B": 3,
        "C": 2,
        "D": 1,
        "E": 0
      },
      "descriptions": {
        "A": "공학적 도구를 능숙하게 사용하여, 논문의 명제/정리를 정확하게 구현하고 올바른 계산/시뮬레이션 결과를 도출 및 시각화함.",
        "B": "공학적 도구를 사용하여 계산이나 시뮬레이션을 수행하였으나, 논문의 명제/정리를 적용하는 과정이 일부 부정확하거나 결과 도출에 사소한 오류가 있음.",
        "C": "공학적 도구의 사용이 미숙하거나, 계산/시뮬레이션 과정에 오류가 있어 논문의 명제/정리를 올바르게 적용하지 못함.",
        "D": "공학적 도구를 사용하려는 시도는 있었으나, 논문의 내용과 관련 없는 계산을 수행하거나 도구 사용에 실패함.",
        "E": "공학적 도구를 활용한 적용을 전혀 수행하지 않음."
      }
    },
    {
      "name": "성찰하기",
      "type": "5-point",
      "scores": {
        "A": 4,
        "B": 3,
        "C": 2,
        "D": 1,
        "E": 0
      },
      "descriptions": {
        "A": "탐구 내용에 대한 깊은 이해를 바탕으로 논리적이고 심도 있는 질문을 제시하고, 이에 대한 수학적 해결 과정과 타당한 결론을 창의적으로 도출함.",
        "B": "탐구 내용을 바탕으로 적절한 질문을 제시하였으나, 해결 과정이 다소 피상적이거나 결론 도출이 미흡함.",
        "C": "탐구 내용과 관련된 질문을 제시하였으나, 질문의 수준이 평이하거나 수학적 해결 과정 없이 주관적인 결론만 제시함.",
        "D": "탐구 내용과 직접적인 관련이 적은 질문을 제시하거나, 질문에 대한 어떠한 해결 방안이나 결론도 제시하지 못함.",
        "E": "심화 질문이나 성찰을 전혀 수행하지 않음."
      }
    },
    {
      "name": "참여 및 성실도",
      "type": "5-point",
      "scores": {
        "A": 4,
        "B": 3,
        "C": 2,
        "D": 1,
        "E": 0
      },
      "descriptions": {
        "A": "수학적 호기심을 바탕으로 자율적으로 주제를 선택하고, 보고서를 기한 내에 성실히 제출하였으며, 타 학생의 발표에 적극적으로 경청하고 건설적인 토론에 참여함.",
        "B": "주제를 선택하고 보고서를 제출하였으나, 토론 참여가 다소 소극적이거나 형식적인 수준에 그침.",
        "C": "보고서를 제출하였으나, 주제 선택 과정이 수동적이거나 토론에 거의 참여하지 않음.",
        "D": "보고서를 제출하였으나, 내용이 매우 부실하거나 기한을 지키지 못했으며, 토론에 전혀 참여하지 않음.",
        "E": "보고서를 제출하지 않음."
      }
    }
  ]
}
